package consolProjectTemplate;

// 희원이 담당! 메뉴를 관리하는 클래스
public class Menu {

	// 게임을 시작하기에 앞서 플레이어의 이름을 입력받기 위해 만든 함수
	public Player init() {
		/* 스트링으로 플레이어의 이름을 입력받고
		 * 플레이어의 객체를 만들어주고 플레이어를 리턴시켜준다.
		 * 리턴을 안해주기 때문에 빨간색 뜨는거니 리턴시켜주면 없어진다
		 */
	}
	
	// 메인 메뉴를 보여주는 함수. 매개변수로 샵, 인벤, 월드맵, 아이템배열, 플레이어를 받는다
	public void showMenu() {
	
		// 메인 메뉴는 특정 번호를 누를때까지 계속 반복 된다.
		// 해당 메뉴에 맞는 번호를 입력 받았으면 메인 메뉴 함수를 불러온다
	}
	
	// 선택한 메뉴로 이동하기 위한 메인메뉴 함수
	// 매개변수로 선택한 번호, 샵, 인벤, 월드맵, 아이템, 플레이어를 받는다
	public void mainMenu() {
	
		// 선택한 메뉴 번호에 따라 해당 객체의 어떤 함수로 이동한다.
		// 예) 1번 상점, 2번 인벤, 3번 월드맵
	
	}
}
