package consolProjectTemplate;

// 세진이 담당! 샵을 관리하는 클래스
public class Shop {

	// 상점 아이템을 담을 리스트를 선언한다.
	
	// 아이템배열을 매개변수로 받는 생성자를 만들어서 그 안에 아이템 정보를 담고 상점리스트에 추가한다
	
	// 상점 아이템을 보여주는 함수, 매개변수로 인벤, 월드맵, 아이템배열, 플레이어를 받는다
	public void ShowShopItem() {
	
			/* 여기에서는 아이템을 진열해서 보여준다.
			 * 아이템의 재고가 없으면 재고가 없다고 출력해주고
			 * 아이템 번호를 누르면 해당 아이템을 구매하는 함수를 불러오고 상점에서 해당아이템을 지운다.
			 * 0번을 누르면 메인 메뉴로 돌아간다
			 * 
			 */
	}
	
	// 아이템을 구매 하는 함수, 매개변수로 인벤, 아이템 배열, 내가 선택한 번호를 받는다
	public void BuyItem() {
		// 아이템을 구매 했으면 내 인벤토리에 넣어준다
	}
}
